Bend profiles can only contain lines and single arcs divided by a line.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
 Syntax
  C#
public static FailureDefinitionId BentFabricSheetInvalidElementInSketch { get; }
  Visual Basic
Public Shared ReadOnly Property BentFabricSheetInvalidElementInSketch As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ BentFabricSheetInvalidElementInSketch {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace